# 1️⃣IS➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
# >>> a = 10
# >>> a = 10
# >>> b = 10
# >>> print(a is b)
# True
# >>> id(a)
# 140724992824728
# >>> id(b)
# 140724992824728
# >>> id(a) == id(b)
# True

# >>> a = 12
# >>> b = a
# >>> print(b is a)
# True
# >>> id(a)
# 140724992824792
# >>> id(b)
# 140724992824792
# >>> id(a) == id(b)
# True

# >>> a = [1,2,3]
# >>> b = a
# >>> print(a is b)
# True
# >>> id(a) == id(b)
# True

# >>> a = [1,2,3]
# >>> b = a.copy()
# >>> print(a is b)
# False

# 2️⃣IS NOT➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
# >>> a = 12
# >>> b = a
# >>> print(a is not b)
# False

# >>> a = [1,2,3]
# >>> b = a.copy()
# >>> print(a is not b)
# True